Revit 2027 API
BuildingEnvelopeAnalyzerOptions Constructor
 Constructs a new instance of BuildingEnvelopeAnalyzerOptions, using default values.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BuildingEnvelopeAnalyzerOptions()
Public Sub New
public:
BuildingEnvelopeAnalyzerOptions()
new : unit -> BuildingEnvelopeAnalyzerOptions
See Also
Reference
BuildingEnvelopeAnalyzerOptions Class
Autodesk.Revit.DB.Analysis Namespace